In [1]:
import pandas as pd

In [4]:
'13 14 15 16'.split()

['13', '14', '15', '16']

In [2]:
data = [(1, 2, 3, 4),
        (5, 6, 7, 8),
        (8, 10, 11, 12),
        (13, 14, 15, 16)]
df = pd.DataFrame(data, 'l1 l2 l3 l4'.split(), 'c1 c2 c3 c4'.split())

In [3]:
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [5]:
df['c1']

l1     1
l2     5
l3     8
l4    13
Name: c1, dtype: int64

In [6]:
type(df['c1'])

pandas.core.series.Series

In [7]:
df[['c3', 'c1']]

    c3  c1
l1   3   1
l2   7   5
l3  11   8
l4  15  13

In [9]:
type(df[['c3', 'c1']])

pandas.core.frame.DataFrame

In [10]:
df[:]

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [11]:
df[1:]

    c1  c2  c3  c4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [12]:
df[1:3]

    c1  c2  c3  c4
l2   5   6   7   8
l3   8  10  11  12

In [13]:
df[1:][['c3', 'c1']]

    c3  c1
l2   7   5
l3  11   8
l4  15  13

In [14]:
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [15]:
# Localiza por linha
df.loc['l3']

c1     8
c2    10
c3    11
c4    12
Name: l3, dtype: int64

In [16]:
df.loc[['l3', 'l1']]

    c1  c2  c3  c4
l3   8  10  11  12
l1   1   2   3   4

In [18]:
# Localiza por linha e coluna
df.loc['l1', 'c3']

3

In [19]:
# Localiza por index(Ã­ndice)
df.iloc[0, 2]

3

In [20]:
df.loc[['l3', 'l1'],['c2', 'c4']]

    c2  c4
l3  10  12
l1   2   4

In [21]:
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [23]:
df.iloc[[1, 3], [0, 3]]

    c1  c4
l2   5   8
l4  13  16